const dataUtils = {
    /**
     * 生成数列
     * @param {number} start 开始序号
     * @param {number} end 结束序号
     * @param {number} step 步长
     */
    createSequence(start = 0, end, step = 1) {
        const arr = []
        for (let i = start; i <= end; i += step) {
            arr.push(i.toString())
        }
        return arr
    }
}
const insetData = [
    {
        title: "年龄",
        data: ["出生", ...dataUtils.createSequence(1, 100).map(s => s + "岁"), "100岁以上"]
    },
    {
        title: "性别",
        data: ["男性", "女性", "其他性别"]
    },
    {
        title: "中国省级行政区",
        data: ["河北省", "山西省", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "海南省", "四川省", "贵州省", "云南省", "陕西省", "甘肃省", "青海省", "台湾省", "内蒙古自治区", "广西壮族自治区", "西藏自治区", "宁夏回族自治区", "新疆维吾尔自治区", "北京市", "上海市", "天津市", "重庆市", "香港特别行政区", "澳门特别行政区"]
    },
    {
        title: "中国主要城市",
        data: [
            "北京市",
            "天津市",
            "石家庄", "邯郸", "唐山", "保定", "秦皇岛", "邢台", "张家口", "承德", "沧州", "廊坊", "衡水",
            "定州", "辛集", "平泉", "晋州", "新乐", "遵化", "迁安", "霸州", "三河", "涿州", "安国", "高碑店", "泊头", "任丘", "黄骅", "河间", "滦州", "深州", "南宫", "沙河", "武安",
            "太原", "大同", "朔州", "阳泉", "长治", "晋城", "忻州", "吕梁", "晋中", "临汾", "运城",
            "古交", "怀仁", "高平", "原平", "孝义", "汾阳", "介休", "侯马", "霍州", "永济", "河津",
            "呼和浩特", "包头", "乌海", "赤峰", "呼伦贝尔", "通辽", "乌兰察布", "鄂尔多斯", "巴彦淖尔",
            "满洲里", "扎兰屯", "牙克石", "根河", "额尔古纳", "乌兰浩特", "阿尔山", "霍林郭勒", "锡林浩特", "二连浩特", "丰镇",
            "沈阳", "大连", "朝阳", "阜新", "铁岭", "抚顺", "本溪", "辽阳", "鞍山", "丹东", "营口", "盘锦", "锦州", "葫芦岛",
            "新民", "瓦房店", "庄河", "北票", "凌源", "调兵山", "开原", "灯塔", "海城", "凤城", "东港", "大石桥", "盖州", "凌海", "北镇", "兴城",
            "长春", "吉林市", "白城", "松原", "四平", "辽源", "通化", "白山",
            "德惠", "榆树", "磐石", "蛟河", "桦甸", "舒兰", "洮南", "大安", "双辽", "公主岭", "梅河口", "集安", "临江", "延吉", "图们", "敦化", "珲春", "龙井", "和龙", "扶余",
            "哈尔滨", "齐齐哈尔", "牡丹江", "佳木斯", "七台河", "大庆", "黑河", "伊春", "鹤岗", "双鸭山", "鸡西", "绥化",
            "绥芬河", "抚远", "尚志", "五常", "讷河", "北安", "五大连池", "铁力", "同江", "富锦", "虎林", "海林", "密山", "宁安", "安达", "肇东", "海伦", "穆棱", "东宁", "漠河",
            "上海市",
            "南京", "徐州", "连云港", "宿迁", "淮安", "盐城", "扬州", "泰州", "南通", "镇江", "常州", "无锡", "苏州",
            "江阴", "宜兴", "邳州", "新沂", "海安", "溧阳", "常熟", "张家港", "太仓", "昆山", "如皋", "海门", "启东", "东台", "高邮", "仪征", "扬中", "句容", "丹阳", "兴化", "泰兴", "靖江",
            "杭州", "宁波", "湖州", "嘉兴", "舟山", "绍兴", "衢州", "金华", "台州", "温州", "丽水",
            "建德", "慈溪", "余姚", "平湖", "海宁", "桐乡", "诸暨", "嵊州", "江山", "兰溪", "永康", "义乌", "东阳", "临海", "温岭", "玉环", "瑞安", "乐清", "龙泉",
            "合肥", "宿州", "淮北", "阜阳", "蚌埠", "淮南", "滁州", "马鞍山", "芜湖", "铜陵", "安庆", "黄山", "六安", "池州", "宣城", "亳州",
            "界首", "明光", "天长", "桐城", "宁国", "巢湖", "潜山", "广德",
            "福州", "厦门", "南平", "三明", "莆田", "泉州", "漳州", "龙岩", "宁德",
            "福清", "邵武", "武夷山", "建瓯", "永安", "石狮", "晋江", "南安", "龙海", "漳平", "福安", "福鼎",
            "南昌", "九江", "赣州", "景德镇", "鹰潭", "新余", "萍乡", "上饶", "抚州", "宜春", "吉安",
            "庐山", "瑞昌", "乐平", "瑞金", "德兴", "丰城", "樟树", "高安", "井冈山", "贵溪", "共青城",
            "济南", "青岛", "聊城", "德州", "东营", "淄博", "潍坊", "烟台", "威海", "日照", "临沂", "枣庄", "济宁", "泰安", "滨州", "菏泽",
            "即墨", "平度", "胶州", "莱西", "临清", "乐陵", "禹城", "安丘", "昌邑", "高密", "青州", "诸城", "寿光", "栖霞", "海阳", "龙口", "莱阳", "莱州", "蓬莱", "招远", "荣成", "乳山", "滕州", "曲阜", "邹城", "新泰", "肥城", "邹平",
            "郑州", "开封", "洛阳", "平顶山", "安阳", "鹤壁", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "周口", "驻马店", "信阳",
            "济源",
            "巩义", "荥阳", "新郑", "登封", "新密", "偃师", "汝州", "舞钢", "孟州", "沁阳", "卫辉", "辉县", "林州", "禹州", "长葛", "义马", "灵宝", "邓州", "永城", "项城",
            "武汉", "十堰", "襄阳", "荆门", "孝感", "黄冈", "鄂州", "黄石", "咸宁", "荆州", "宜昌", "随州",
            "仙桃", "天门", "潜江",
            "丹江口", "老河口", "枣阳", "宜城", "钟祥", "汉川", "应城", "安陆", "广水", "麻城", "武穴", "大冶", "赤壁", "石首", "洪湖", "松滋", "宜都", "枝江", "当阳", "恩施", "利川", "京山",
            "长沙", "衡阳", "张家界", "常德", "益阳", "岳阳", "株洲", "湘潭", "郴州", "永州", "邵阳", "怀化", "娄底",
            "耒阳", "常宁", "浏阳", "津市", "沅江", "汨罗", "临湘", "醴陵", "湘乡", "韶山", "资兴", "武冈", "洪江", "冷水江", "涟源", "吉首", "宁乡",
            "广州", "深圳", "清远", "韶关", "河源", "梅州", "潮州", "汕头", "揭阳", "汕尾", "惠州", "东莞", "珠海", "中山", "江门", "佛山", "肇庆", "云浮", "阳江", "茂名", "湛江",
            "英德", "连州", "乐昌", "南雄", "兴宁", "普宁", "陆丰", "恩平", "台山", "开平", "鹤山", "四会", "罗定", "阳春", "化州", "信宜", "高州", "吴川", "廉江", "雷州",
            "南宁", "桂林", "柳州", "梧州", "贵港", "玉林", "钦州", "北海", "防城港", "崇左", "百色", "河池", "来宾", "贺州",
            "靖西", "岑溪", "桂平", "北流", "东兴", "凭祥", "荔浦", "合山",
            "海口", "三亚", "三沙", "儋州",
            "文昌", "琼海", "万宁", "东方", "五指山",
            "重庆市",
            "成都", "广元", "绵阳", "德阳", "南充", "广安", "遂宁", "内江", "乐山", "自贡", "泸州", "宜宾", "攀枝花", "巴中", "达州", "资阳", "眉山", "雅安",
            "崇州", "邛崃", "都江堰", "彭州", "江油", "什邡", "广汉", "绵竹", "阆中", "华蓥", "峨眉山", "万源", "简阳", "西昌", "康定", "隆昌", "马尔康",
            "贵阳", "六盘水", "遵义", "安顺", "毕节", "铜仁",
            "清镇", "赤水", "仁怀", "凯里", "都匀", "兴义", "福泉", "盘州", "兴仁",
            "昆明", "曲靖", "玉溪", "丽江", "昭通", "普洱", "临沧", "保山",
            "安宁", "宣威", "澄江", "弥勒", "芒市", "瑞丽", "大理", "楚雄", "蒙自", "个旧", "开远", "文山", "香格里拉", "景洪", "腾冲", "泸水", "水富",
            "拉萨", "日喀则", "昌都", "林芝", "山南", "那曲",
            "西安", "宝鸡", "延安", "铜川", "渭南", "咸阳", "汉中", "榆林", "商洛", "安康",
            "韩城", "华阴", "兴平", "彬州", "神木",
            "兰州", "天水", "嘉峪关", "金昌", "白银", "酒泉", "张掖", "武威", "庆阳", "平凉", "定西", "陇南",
            "玉门", "敦煌", "临夏", "合作", "华亭",
            "西宁", "海东",
            "格尔木", "德令哈", "玉树",
            "银川", "石嘴山", "吴忠", "中卫", "固原",
            "灵武", "青铜峡",
            "乌鲁木齐", "克拉玛依", "吐鲁番", "哈密",
            "石河子（八师）", "五家渠（六师）", "阿拉尔（一师）", "图木舒克（三师）", "北屯（十师）", "铁门关（二师）", "双河（五师）", "可克达拉（四师）", "昆玉（十四师）",
            "喀什", "阿克苏", "和田", "阿图什", "博乐", "昌吉", "阜康", "库尔勒", "伊宁", "奎屯", "塔城", "乌苏", "阿勒泰", "阿拉山口", "霍尔果斯",
            "香港特别行政区",
            "澳门特别行政区",
            "台北", "新北", "台中", "台南", "高雄", "桃园", "基隆", "新竹", "嘉义", "苗栗", "彰化", "南投", "斗六", "朴子", "屏东", "宜兰", "花莲", "台东", "马公"
        ]
    },
    {
        title: "时间段",
        data: [
            "早晨", "中午", "傍晚", "晚上", "午夜", "凌晨"
        ]
    },
    {
        title: "小时",
        data: dataUtils.createSequence(0, 23).map(s => s + "时")
    },
    {
        title: "星期",
        data: ["星期一", "星期二", "星期三", "星期四", "星期五", "星期六", "星期日"]
    },
    {
        title: "部分程序语言",
        data: ["Java", "C", "Python", "C++", "C#", "Visual Basic .NET", "JavaScript", "PHP", "SQL", "Swift", "Ruby", "SQL", "Delphi", "Object Pascal", "Objective-C", "Assembly Language", "Go", "R", "MATLAB", "D", "Viusal Basic", "Perl", "其他"]
    },
    {
        title: "字母",
        data: dataUtils.createSequence(0, 25).map((_, i) => String.fromCharCode(0x41 + i))
    },
    {
        title: "2500个常用汉字",
        data: ["一", "乙", "二", "十", "丁", "厂", "七", "卜", "人", "入", "八", "九", "几", "儿", "了", "力", "乃", "刀", "又", "三", "于", "干", "亏", "士", "工", "土", "才", "寸", "下", "大", "丈", "与", "万", "上", "小", "口", "巾", "山", "千", "乞", "川", "亿", "个", "勺", "久", "凡", "及", "夕", "丸", "么", "广", "亡", "门", "义", "之", "尸", "弓", "己", "已", "子", "卫", "也", "女", "飞", "刃", "习", "叉", "马", "乡", "丰", "王", "井", "开", "夫", "天", "无", "元", "专", "云", "扎", "艺", "木", "五", "支", "厅", "不", "太", "犬", "区", "历", "尤", "友", "匹", "车", "巨", "牙", "屯", "比", "互", "切", "瓦", "止", "少", "日", "中", "冈", "贝", "内", "水", "见", "午", "牛", "手", "毛", "气", "升", "长", "仁", "什", "片", "仆", "化", "仇", "币", "仍", "仅", "斤", "爪", "反", "介", "父", "从", "今", "凶", "分", "乏", "公", "仓", "月", "氏", "勿", "欠", "风", "丹", "匀", "乌", "凤", "勾", "文", "六", "方", "火", "为", "斗", "忆", "订", "计", "户", "认", "心", "尺", "引", "丑", "巴", "孔", "队", "办", "以", "允", "予", "劝", "双", "书", "幻", "玉", "刊", "示", "末", "未", "击", "打", "巧", "正", "扑", "扒", "功", "扔", "去", "甘", "世", "古", "节", "本", "术", "可", "丙", "左", "厉", "右", "石", "布", "龙", "平", "灭", "轧", "东", "卡", "北", "占", "业", "旧", "帅", "归", "且", "旦", "目", "叶", "甲", "申", "叮", "电", "号", "田", "由", "史", "只", "央", "兄", "叼", "叫", "另", "叨", "叹", "四", "生", "失", "禾", "丘", "付", "仗", "代", "仙", "们", "仪", "白", "仔", "他", "斥", "瓜", "乎", "丛", "令", "用", "甩", "印", "乐", "句", "匆", "册", "犯", "外", "处", "冬", "鸟", "务", "包", "饥", "主", "市", "立", "闪", "兰", "半", "汁", "汇", "头", "汉", "宁", "穴", "它", "讨", "写", "让", "礼", "训", "必", "议", "讯", "记", "永", "司", "尼", "民", "出", "辽", "奶", "奴", "加", "召", "皮", "边", "发", "孕", "圣", "对", "台", "矛", "纠", "母", "幼", "丝", "式", "刑", "动", "扛", "寺", "吉", "扣", "考", "托", "老", "执", "巩", "圾", "扩", "扫", "地", "扬", "场", "耳", "共", "芒", "亚", "芝", "朽", "朴", "机", "权", "过", "臣", "再", "协", "西", "压", "厌", "在", "有", "百", "存", "而", "页", "匠", "夸", "夺", "灰", "达", "列", "死", "成", "夹", "轨", "邪", "划", "迈", "毕", "至", "此", "贞", "师", "尘", "尖", "劣", "光", "当", "早", "吐", "吓", "虫", "曲", "团", "同", "吊", "吃", "因", "吸", "吗", "屿", "帆", "岁", "回", "岂", "刚", "则", "肉", "网", "年", "朱", "先", "丢", "舌", "竹", "迁", "乔", "伟", "传", "乒", "乓", "休", "伍", "伏", "优", "伐", "延", "件", "任", "伤", "价", "份", "华", "仰", "仿", "伙", "伪", "自", "血", "向", "似", "后", "行", "舟", "全", "会", "杀", "合", "兆", "企", "众", "爷", "伞", "创", "肌", "朵", "杂", "危", "旬", "旨", "负", "各", "名", "多", "争", "色", "壮", "冲", "冰", "庄", "庆", "亦", "刘", "齐", "交", "次", "衣", "产", "决", "充", "妄", "闭", "问", "闯", "羊", "并", "关", "米", "灯", "州", "汗", "污", "江", "池", "汤", "忙", "兴", "宇", "守", "宅", "字", "安", "讲", "军", "许", "论", "农", "讽", "设", "访", "寻", "那", "迅", "尽", "导", "异", "孙", "阵", "阳", "收", "阶", "阴", "防", "奸", "如", "妇", "好", "她", "妈", "戏", "羽", "观", "欢", "买", "红", "纤", "级", "约", "纪", "驰", "巡", "寿", "弄", "麦", "形", "进", "戒", "吞", "远", "违", "运", "扶", "抚", "坛", "技", "坏", "扰", "拒", "找", "批", "扯", "址", "走", "抄", "坝", "贡", "攻", "赤", "折", "抓", "扮", "抢", "孝", "均", "抛", "投", "坟", "抗", "坑", "坊", "抖", "护", "壳", "志", "扭", "块", "声", "把", "报", "却", "劫", "芽", "花", "芹", "芬", "苍", "芳", "严", "芦", "劳", "克", "苏", "杆", "杠", "杜", "材", "村", "杏", "极", "李", "杨", "求", "更", "束", "豆", "两", "丽", "医", "辰", "励", "否", "还", "歼", "来", "连", "步", "坚", "旱", "盯", "呈", "时", "吴", "助", "县", "里", "呆", "园", "旷", "围", "呀", "吨", "足", "邮", "男", "困", "吵", "串", "员", "听", "吩", "吹", "呜", "吧", "吼", "别", "岗", "帐", "财", "针", "钉", "告", "我", "乱", "利", "秃", "秀", "私", "每", "兵", "估", "体", "何", "但", "伸", "作", "伯", "伶", "佣", "低", "你", "住", "位", "伴", "身", "皂", "佛", "近", "彻", "役", "返", "余", "希", "坐", "谷", "妥", "含", "邻", "岔", "肝", "肚", "肠", "龟", "免", "狂", "犹", "角", "删", "条", "卵", "岛", "迎", "饭", "饮", "系", "言", "冻", "状", "亩", "况", "床", "库", "疗", "应", "冷", "这", "序", "辛", "弃", "冶", "忘", "闲", "间", "闷", "判", "灶", "灿", "弟", "汪", "沙", "汽", "沃", "泛", "沟", "没", "沈", "沉", "怀", "忧", "快", "完", "宋", "宏", "牢", "究", "穷", "灾", "良", "证", "启", "评", "补", "初", "社", "识", "诉", "诊", "词", "译", "君", "灵", "即", "层", "尿", "尾", "迟", "局", "改", "张", "忌", "际", "陆", "阿", "陈", "阻", "附", "妙", "妖", "妨", "努", "忍", "劲", "鸡", "驱", "纯", "纱", "纳", "纲", "驳", "纵", "纷", "纸", "纹", "纺", "驴", "纽", "奉", "玩", "环", "武", "青", "责", "现", "表", "规", "抹", "拢", "拔", "拣", "担", "坦", "押", "抽", "拐", "拖", "拍", "者", "顶", "拆", "拥", "抵", "拘", "势", "抱", "垃", "拉", "拦", "拌", "幸", "招", "坡", "披", "拨", "择", "抬", "其", "取", "苦", "若", "茂", "苹", "苗", "英", "范", "直", "茄", "茎", "茅", "林", "枝", "杯", "柜", "析", "板", "松", "枪", "构", "杰", "述", "枕", "丧", "或", "画", "卧", "事", "刺", "枣", "雨", "卖", "矿", "码", "厕", "奔", "奇", "奋", "态", "欧", "垄", "妻", "轰", "顷", "转", "斩", "轮", "软", "到", "非", "叔", "肯", "齿", "些", "虎", "虏", "肾", "贤", "尚", "旺", "具", "果", "味", "昆", "国", "昌", "畅", "明", "易", "昂", "典", "固", "忠", "咐", "呼", "鸣", "咏", "呢", "岸", "岩", "帖", "罗", "帜", "岭", "凯", "败", "贩", "购", "图", "钓", "制", "知", "垂", "牧", "物", "乖", "刮", "秆", "和", "季", "委", "佳", "侍", "供", "使", "例", "版", "侄", "侦", "侧", "凭", "侨", "佩", "货", "依", "的", "迫", "质", "欣", "征", "往", "爬", "彼", "径", "所", "舍", "金", "命", "斧", "爸", "采", "受", "乳", "贪", "念", "贫", "肤", "肺", "肢", "肿", "胀", "朋", "股", "肥", "服", "胁", "周", "昏", "鱼", "兔", "狐", "忽", "狗", "备", "饰", "饱", "饲", "变", "京", "享", "店", "夜"]
    },
    {
        title: "手指",
        data: ["大拇指", "食指", "中指", "无名指", "小拇指"]
    },
    {
        title: "五官",
        data: [..."耳眉眼鼻口"]
    },
    {
        title: "过去100年",
        data: dataUtils.createSequence(new Date().getFullYear() - 99, new Date().getFullYear()).map(s => s + "年")
    },
    {
        title: "未来100年",
        data: dataUtils.createSequence(new Date().getFullYear(), new Date().getFullYear() + 99).map(s => s + "年")
    },
    {
        title: "日期",
        data: (function () {
            const dayInMonths = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
            const arr = dayInMonths.map(
                (dayInMonth, m) => dataUtils.createSequence(1, 31)
                    .map(d => `${m + 1}月${d}日`)
            ).flat(1)
            return arr
        })()
    }
]